ataradov/mcu-starter-projects/samg53/include/component/mem2mem.h
/**
 * \file
 *
 * \brief Component description for MEM2MEM
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-07-05T18:00:00Z */
#ifndef _SAMG53_MEM2MEM_COMPONENT_H_
#define _SAMG53_MEM2MEM_COMPONENT_H_
#define _SAMG53_MEM2MEM_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMG_SAMG53 Memory to Memory
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR MEM2MEM */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define MEM2MEM_11211                      /**< (MEM2MEM) Module ID */
#define REV_MEM2MEM A                      /**< (MEM2MEM) Module revision */

/* -------- MEM2MEM_THR : (MEM2MEM Offset: 0x00) (R/W 32) Memory to Memory Transfer Holding Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t THDATA:32;                 /**< bit:  0..31  Transfer Holding Data                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_THR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_THR_OFFSET                  (0x00)                                        /**<  (MEM2MEM_THR) Memory to Memory Transfer Holding Register  Offset */

#define MEM2MEM_THR_THDATA_Pos              0                                              /**< (MEM2MEM_THR) Transfer Holding Data Position */
#define MEM2MEM_THR_THDATA_Msk              (_U_(0xFFFFFFFF) << MEM2MEM_THR_THDATA_Pos)    /**< (MEM2MEM_THR) Transfer Holding Data Mask */
#define MEM2MEM_THR_THDATA(value)           (MEM2MEM_THR_THDATA_Msk & ((value) << MEM2MEM_THR_THDATA_Pos))
#define MEM2MEM_THR_MASK                    _U_(0xFFFFFFFF)                                /**< \deprecated (MEM2MEM_THR) Register MASK  (Use MEM2MEM_THR_Msk instead)  */
#define MEM2MEM_THR_Msk                     _U_(0xFFFFFFFF)                                /**< (MEM2MEM_THR) Register Mask  */


/* -------- MEM2MEM_MR : (MEM2MEM Offset: 0x04) (R/W 32) Memory to Memory Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TSIZE:2;                   /**< bit:   0..1  Transfer Size                            */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_MR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_MR_OFFSET                   (0x04)                                        /**<  (MEM2MEM_MR) Memory to Memory Mode Register  Offset */

#define MEM2MEM_MR_TSIZE_Pos                0                                              /**< (MEM2MEM_MR) Transfer Size Position */
#define MEM2MEM_MR_TSIZE_Msk                (_U_(0x3) << MEM2MEM_MR_TSIZE_Pos)             /**< (MEM2MEM_MR) Transfer Size Mask */
#define MEM2MEM_MR_TSIZE(value)             (MEM2MEM_MR_TSIZE_Msk & ((value) << MEM2MEM_MR_TSIZE_Pos))
#define   MEM2MEM_MR_TSIZE_T_8BIT_Val       _U_(0x0)                                       /**< (MEM2MEM_MR) The buffer size is defined in byte.  */
#define   MEM2MEM_MR_TSIZE_T_16BIT_Val      _U_(0x1)                                       /**< (MEM2MEM_MR) The buffer size is defined in half-word (16-bit).  */
#define   MEM2MEM_MR_TSIZE_T_32BIT_Val      _U_(0x2)                                       /**< (MEM2MEM_MR) The buffer size is defined in word (32-bit). Default value.  */
#define MEM2MEM_MR_TSIZE_T_8BIT             (MEM2MEM_MR_TSIZE_T_8BIT_Val << MEM2MEM_MR_TSIZE_Pos)  /**< (MEM2MEM_MR) The buffer size is defined in byte. Position  */
#define MEM2MEM_MR_TSIZE_T_16BIT            (MEM2MEM_MR_TSIZE_T_16BIT_Val << MEM2MEM_MR_TSIZE_Pos)  /**< (MEM2MEM_MR) The buffer size is defined in half-word (16-bit). Position  */
#define MEM2MEM_MR_TSIZE_T_32BIT            (MEM2MEM_MR_TSIZE_T_32BIT_Val << MEM2MEM_MR_TSIZE_Pos)  /**< (MEM2MEM_MR) The buffer size is defined in word (32-bit). Default value. Position  */
#define MEM2MEM_MR_MASK                     _U_(0x03)                                      /**< \deprecated (MEM2MEM_MR) Register MASK  (Use MEM2MEM_MR_Msk instead)  */
#define MEM2MEM_MR_Msk                      _U_(0x03)                                      /**< (MEM2MEM_MR) Register Mask  */


/* -------- MEM2MEM_IER : (MEM2MEM Offset: 0x08) (/W 32) Memory to Memory Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXEND:1;                   /**< bit:      0  End of Transfer Interrupt Enable         */
    uint32_t RXBUFF:1;                  /**< bit:      1  Buffer Full Interrupt Enable             */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_IER_Type;
