ataradov/mcu-starter-projects/samg53/include/component/mem2mem.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_IER_OFFSET                  (0x08)                                        /**<  (MEM2MEM_IER) Memory to Memory Interrupt Enable Register  Offset */

#define MEM2MEM_IER_RXEND_Pos               0                                              /**< (MEM2MEM_IER) End of Transfer Interrupt Enable Position */
#define MEM2MEM_IER_RXEND_Msk               (_U_(0x1) << MEM2MEM_IER_RXEND_Pos)            /**< (MEM2MEM_IER) End of Transfer Interrupt Enable Mask */
#define MEM2MEM_IER_RXEND                   MEM2MEM_IER_RXEND_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_IER_RXEND_Msk instead */
#define MEM2MEM_IER_RXBUFF_Pos              1                                              /**< (MEM2MEM_IER) Buffer Full Interrupt Enable Position */
#define MEM2MEM_IER_RXBUFF_Msk              (_U_(0x1) << MEM2MEM_IER_RXBUFF_Pos)           /**< (MEM2MEM_IER) Buffer Full Interrupt Enable Mask */
#define MEM2MEM_IER_RXBUFF                  MEM2MEM_IER_RXBUFF_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_IER_RXBUFF_Msk instead */
#define MEM2MEM_IER_MASK                    _U_(0x03)                                      /**< \deprecated (MEM2MEM_IER) Register MASK  (Use MEM2MEM_IER_Msk instead)  */
#define MEM2MEM_IER_Msk                     _U_(0x03)                                      /**< (MEM2MEM_IER) Register Mask  */


/* -------- MEM2MEM_IDR : (MEM2MEM Offset: 0x0c) (/W 32) Memory to Memory Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXEND:1;                   /**< bit:      0  End of Transfer Interrupt Disable        */
    uint32_t RXBUFF:1;                  /**< bit:      1  Buffer Full Interrupt Disable            */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_IDR_OFFSET                  (0x0C)                                        /**<  (MEM2MEM_IDR) Memory to Memory Interrupt Disable Register  Offset */

#define MEM2MEM_IDR_RXEND_Pos               0                                              /**< (MEM2MEM_IDR) End of Transfer Interrupt Disable Position */
#define MEM2MEM_IDR_RXEND_Msk               (_U_(0x1) << MEM2MEM_IDR_RXEND_Pos)            /**< (MEM2MEM_IDR) End of Transfer Interrupt Disable Mask */
#define MEM2MEM_IDR_RXEND                   MEM2MEM_IDR_RXEND_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_IDR_RXEND_Msk instead */
#define MEM2MEM_IDR_RXBUFF_Pos              1                                              /**< (MEM2MEM_IDR) Buffer Full Interrupt Disable Position */
#define MEM2MEM_IDR_RXBUFF_Msk              (_U_(0x1) << MEM2MEM_IDR_RXBUFF_Pos)           /**< (MEM2MEM_IDR) Buffer Full Interrupt Disable Mask */
#define MEM2MEM_IDR_RXBUFF                  MEM2MEM_IDR_RXBUFF_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_IDR_RXBUFF_Msk instead */
#define MEM2MEM_IDR_MASK                    _U_(0x03)                                      /**< \deprecated (MEM2MEM_IDR) Register MASK  (Use MEM2MEM_IDR_Msk instead)  */
#define MEM2MEM_IDR_Msk                     _U_(0x03)                                      /**< (MEM2MEM_IDR) Register Mask  */


/* -------- MEM2MEM_IMR : (MEM2MEM Offset: 0x10) (R/ 32) Memory to Memory Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXEND:1;                   /**< bit:      0  End of Transfer Interrupt Mask           */
    uint32_t RXBUFF:1;                  /**< bit:      1  Buffer Full Interrupt Mask               */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_IMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_IMR_OFFSET                  (0x10)                                        /**<  (MEM2MEM_IMR) Memory to Memory Interrupt Mask Register  Offset */

#define MEM2MEM_IMR_RXEND_Pos               0                                              /**< (MEM2MEM_IMR) End of Transfer Interrupt Mask Position */
#define MEM2MEM_IMR_RXEND_Msk               (_U_(0x1) << MEM2MEM_IMR_RXEND_Pos)            /**< (MEM2MEM_IMR) End of Transfer Interrupt Mask Mask */
#define MEM2MEM_IMR_RXEND                   MEM2MEM_IMR_RXEND_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_IMR_RXEND_Msk instead */
#define MEM2MEM_IMR_RXBUFF_Pos              1                                              /**< (MEM2MEM_IMR) Buffer Full Interrupt Mask Position */
#define MEM2MEM_IMR_RXBUFF_Msk              (_U_(0x1) << MEM2MEM_IMR_RXBUFF_Pos)           /**< (MEM2MEM_IMR) Buffer Full Interrupt Mask Mask */
#define MEM2MEM_IMR_RXBUFF                  MEM2MEM_IMR_RXBUFF_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_IMR_RXBUFF_Msk instead */
#define MEM2MEM_IMR_MASK                    _U_(0x03)                                      /**< \deprecated (MEM2MEM_IMR) Register MASK  (Use MEM2MEM_IMR_Msk instead)  */
#define MEM2MEM_IMR_Msk                     _U_(0x03)                                      /**< (MEM2MEM_IMR) Register Mask  */


/* -------- MEM2MEM_ISR : (MEM2MEM Offset: 0x14) (R/ 32) Memory to Memory Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXEND:1;                   /**< bit:      0  End of Transfer                          */
    uint32_t RXBUFF:1;                  /**< bit:      1  Buffer Full                              */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_ISR_Type;
