ataradov/mcu-starter-projects/samg53/include/component/mem2mem.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_ISR_OFFSET                  (0x14)                                        /**<  (MEM2MEM_ISR) Memory to Memory Interrupt Status Register  Offset */

#define MEM2MEM_ISR_RXEND_Pos               0                                              /**< (MEM2MEM_ISR) End of Transfer Position */
#define MEM2MEM_ISR_RXEND_Msk               (_U_(0x1) << MEM2MEM_ISR_RXEND_Pos)            /**< (MEM2MEM_ISR) End of Transfer Mask */
#define MEM2MEM_ISR_RXEND                   MEM2MEM_ISR_RXEND_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_ISR_RXEND_Msk instead */
#define MEM2MEM_ISR_RXBUFF_Pos              1                                              /**< (MEM2MEM_ISR) Buffer Full Position */
#define MEM2MEM_ISR_RXBUFF_Msk              (_U_(0x1) << MEM2MEM_ISR_RXBUFF_Pos)           /**< (MEM2MEM_ISR) Buffer Full Mask */
#define MEM2MEM_ISR_RXBUFF                  MEM2MEM_ISR_RXBUFF_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_ISR_RXBUFF_Msk instead */
#define MEM2MEM_ISR_MASK                    _U_(0x03)                                      /**< \deprecated (MEM2MEM_ISR) Register MASK  (Use MEM2MEM_ISR_Msk instead)  */
#define MEM2MEM_ISR_Msk                     _U_(0x03)                                      /**< (MEM2MEM_ISR) Register Mask  */


/* -------- MEM2MEM_RPR : (MEM2MEM Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXPTR:32;                  /**< bit:  0..31  Receive Pointer Register                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_RPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_RPR_OFFSET                  (0x100)                                       /**<  (MEM2MEM_RPR) Receive Pointer Register  Offset */

#define MEM2MEM_RPR_RXPTR_Pos               0                                              /**< (MEM2MEM_RPR) Receive Pointer Register Position */
#define MEM2MEM_RPR_RXPTR_Msk               (_U_(0xFFFFFFFF) << MEM2MEM_RPR_RXPTR_Pos)     /**< (MEM2MEM_RPR) Receive Pointer Register Mask */
#define MEM2MEM_RPR_RXPTR(value)            (MEM2MEM_RPR_RXPTR_Msk & ((value) << MEM2MEM_RPR_RXPTR_Pos))
#define MEM2MEM_RPR_MASK                    _U_(0xFFFFFFFF)                                /**< \deprecated (MEM2MEM_RPR) Register MASK  (Use MEM2MEM_RPR_Msk instead)  */
#define MEM2MEM_RPR_Msk                     _U_(0xFFFFFFFF)                                /**< (MEM2MEM_RPR) Register Mask  */


/* -------- MEM2MEM_RCR : (MEM2MEM Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_RCR_OFFSET                  (0x104)                                       /**<  (MEM2MEM_RCR) Receive Counter Register  Offset */

#define MEM2MEM_RCR_RXCTR_Pos               0                                              /**< (MEM2MEM_RCR) Receive Counter Register Position */
#define MEM2MEM_RCR_RXCTR_Msk               (_U_(0xFFFF) << MEM2MEM_RCR_RXCTR_Pos)         /**< (MEM2MEM_RCR) Receive Counter Register Mask */
#define MEM2MEM_RCR_RXCTR(value)            (MEM2MEM_RCR_RXCTR_Msk & ((value) << MEM2MEM_RCR_RXCTR_Pos))
#define MEM2MEM_RCR_MASK                    _U_(0xFFFF)                                    /**< \deprecated (MEM2MEM_RCR) Register MASK  (Use MEM2MEM_RCR_Msk instead)  */
#define MEM2MEM_RCR_Msk                     _U_(0xFFFF)                                    /**< (MEM2MEM_RCR) Register Mask  */


/* -------- MEM2MEM_TPR : (MEM2MEM Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXPTR:32;                  /**< bit:  0..31  Transmit Counter Register                */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_TPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_TPR_OFFSET                  (0x108)                                       /**<  (MEM2MEM_TPR) Transmit Pointer Register  Offset */

#define MEM2MEM_TPR_TXPTR_Pos               0                                              /**< (MEM2MEM_TPR) Transmit Counter Register Position */
#define MEM2MEM_TPR_TXPTR_Msk               (_U_(0xFFFFFFFF) << MEM2MEM_TPR_TXPTR_Pos)     /**< (MEM2MEM_TPR) Transmit Counter Register Mask */
#define MEM2MEM_TPR_TXPTR(value)            (MEM2MEM_TPR_TXPTR_Msk & ((value) << MEM2MEM_TPR_TXPTR_Pos))
#define MEM2MEM_TPR_MASK                    _U_(0xFFFFFFFF)                                /**< \deprecated (MEM2MEM_TPR) Register MASK  (Use MEM2MEM_TPR_Msk instead)  */
#define MEM2MEM_TPR_Msk                     _U_(0xFFFFFFFF)                                /**< (MEM2MEM_TPR) Register Mask  */


/* -------- MEM2MEM_TCR : (MEM2MEM Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_TCR_Type;
