ataradov/mcu-starter-projects/samg53/include/component/mem2mem.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_TCR_OFFSET                  (0x10C)                                       /**<  (MEM2MEM_TCR) Transmit Counter Register  Offset */

#define MEM2MEM_TCR_TXCTR_Pos               0                                              /**< (MEM2MEM_TCR) Transmit Counter Register Position */
#define MEM2MEM_TCR_TXCTR_Msk               (_U_(0xFFFF) << MEM2MEM_TCR_TXCTR_Pos)         /**< (MEM2MEM_TCR) Transmit Counter Register Mask */
#define MEM2MEM_TCR_TXCTR(value)            (MEM2MEM_TCR_TXCTR_Msk & ((value) << MEM2MEM_TCR_TXCTR_Pos))
#define MEM2MEM_TCR_MASK                    _U_(0xFFFF)                                    /**< \deprecated (MEM2MEM_TCR) Register MASK  (Use MEM2MEM_TCR_Msk instead)  */
#define MEM2MEM_TCR_Msk                     _U_(0xFFFF)                                    /**< (MEM2MEM_TCR) Register Mask  */


/* -------- MEM2MEM_RNPR : (MEM2MEM Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_RNPR_OFFSET                 (0x110)                                       /**<  (MEM2MEM_RNPR) Receive Next Pointer Register  Offset */

#define MEM2MEM_RNPR_RXNPTR_Pos             0                                              /**< (MEM2MEM_RNPR) Receive Next Pointer Position */
#define MEM2MEM_RNPR_RXNPTR_Msk             (_U_(0xFFFFFFFF) << MEM2MEM_RNPR_RXNPTR_Pos)   /**< (MEM2MEM_RNPR) Receive Next Pointer Mask */
#define MEM2MEM_RNPR_RXNPTR(value)          (MEM2MEM_RNPR_RXNPTR_Msk & ((value) << MEM2MEM_RNPR_RXNPTR_Pos))
#define MEM2MEM_RNPR_MASK                   _U_(0xFFFFFFFF)                                /**< \deprecated (MEM2MEM_RNPR) Register MASK  (Use MEM2MEM_RNPR_Msk instead)  */
#define MEM2MEM_RNPR_Msk                    _U_(0xFFFFFFFF)                                /**< (MEM2MEM_RNPR) Register Mask  */


/* -------- MEM2MEM_RNCR : (MEM2MEM Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_RNCR_OFFSET                 (0x114)                                       /**<  (MEM2MEM_RNCR) Receive Next Counter Register  Offset */

#define MEM2MEM_RNCR_RXNCTR_Pos             0                                              /**< (MEM2MEM_RNCR) Receive Next Counter Position */
#define MEM2MEM_RNCR_RXNCTR_Msk             (_U_(0xFFFF) << MEM2MEM_RNCR_RXNCTR_Pos)       /**< (MEM2MEM_RNCR) Receive Next Counter Mask */
#define MEM2MEM_RNCR_RXNCTR(value)          (MEM2MEM_RNCR_RXNCTR_Msk & ((value) << MEM2MEM_RNCR_RXNCTR_Pos))
#define MEM2MEM_RNCR_MASK                   _U_(0xFFFF)                                    /**< \deprecated (MEM2MEM_RNCR) Register MASK  (Use MEM2MEM_RNCR_Msk instead)  */
#define MEM2MEM_RNCR_Msk                    _U_(0xFFFF)                                    /**< (MEM2MEM_RNCR) Register Mask  */


/* -------- MEM2MEM_TNPR : (MEM2MEM Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_TNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_TNPR_OFFSET                 (0x118)                                       /**<  (MEM2MEM_TNPR) Transmit Next Pointer Register  Offset */

#define MEM2MEM_TNPR_TXNPTR_Pos             0                                              /**< (MEM2MEM_TNPR) Transmit Next Pointer Position */
#define MEM2MEM_TNPR_TXNPTR_Msk             (_U_(0xFFFFFFFF) << MEM2MEM_TNPR_TXNPTR_Pos)   /**< (MEM2MEM_TNPR) Transmit Next Pointer Mask */
#define MEM2MEM_TNPR_TXNPTR(value)          (MEM2MEM_TNPR_TXNPTR_Msk & ((value) << MEM2MEM_TNPR_TXNPTR_Pos))
#define MEM2MEM_TNPR_MASK                   _U_(0xFFFFFFFF)                                /**< \deprecated (MEM2MEM_TNPR) Register MASK  (Use MEM2MEM_TNPR_Msk instead)  */
#define MEM2MEM_TNPR_Msk                    _U_(0xFFFFFFFF)                                /**< (MEM2MEM_TNPR) Register Mask  */


/* -------- MEM2MEM_TNCR : (MEM2MEM Offset: 0x11c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_TNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_TNCR_OFFSET                 (0x11C)                                       /**<  (MEM2MEM_TNCR) Transmit Next Counter Register  Offset */

#define MEM2MEM_TNCR_TXNCTR_Pos             0                                              /**< (MEM2MEM_TNCR) Transmit Counter Next Position */
#define MEM2MEM_TNCR_TXNCTR_Msk             (_U_(0xFFFF) << MEM2MEM_TNCR_TXNCTR_Pos)       /**< (MEM2MEM_TNCR) Transmit Counter Next Mask */
#define MEM2MEM_TNCR_TXNCTR(value)          (MEM2MEM_TNCR_TXNCTR_Msk & ((value) << MEM2MEM_TNCR_TXNCTR_Pos))
#define MEM2MEM_TNCR_MASK                   _U_(0xFFFF)                                    /**< \deprecated (MEM2MEM_TNCR) Register MASK  (Use MEM2MEM_TNCR_Msk instead)  */
#define MEM2MEM_TNCR_Msk                    _U_(0xFFFF)                                    /**< (MEM2MEM_TNCR) Register Mask  */


/* -------- MEM2MEM_PTCR : (MEM2MEM Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_PTCR_Type;
