ataradov/mcu-starter-projects/samg53/include/component/mem2mem.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_PTCR_OFFSET                 (0x120)                                       /**<  (MEM2MEM_PTCR) Transfer Control Register  Offset */

#define MEM2MEM_PTCR_RXTEN_Pos              0                                              /**< (MEM2MEM_PTCR) Receiver Transfer Enable Position */
#define MEM2MEM_PTCR_RXTEN_Msk              (_U_(0x1) << MEM2MEM_PTCR_RXTEN_Pos)           /**< (MEM2MEM_PTCR) Receiver Transfer Enable Mask */
#define MEM2MEM_PTCR_RXTEN                  MEM2MEM_PTCR_RXTEN_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_RXTEN_Msk instead */
#define MEM2MEM_PTCR_RXTDIS_Pos             1                                              /**< (MEM2MEM_PTCR) Receiver Transfer Disable Position */
#define MEM2MEM_PTCR_RXTDIS_Msk             (_U_(0x1) << MEM2MEM_PTCR_RXTDIS_Pos)          /**< (MEM2MEM_PTCR) Receiver Transfer Disable Mask */
#define MEM2MEM_PTCR_RXTDIS                 MEM2MEM_PTCR_RXTDIS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_RXTDIS_Msk instead */
#define MEM2MEM_PTCR_TXTEN_Pos              8                                              /**< (MEM2MEM_PTCR) Transmitter Transfer Enable Position */
#define MEM2MEM_PTCR_TXTEN_Msk              (_U_(0x1) << MEM2MEM_PTCR_TXTEN_Pos)           /**< (MEM2MEM_PTCR) Transmitter Transfer Enable Mask */
#define MEM2MEM_PTCR_TXTEN                  MEM2MEM_PTCR_TXTEN_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_TXTEN_Msk instead */
#define MEM2MEM_PTCR_TXTDIS_Pos             9                                              /**< (MEM2MEM_PTCR) Transmitter Transfer Disable Position */
#define MEM2MEM_PTCR_TXTDIS_Msk             (_U_(0x1) << MEM2MEM_PTCR_TXTDIS_Pos)          /**< (MEM2MEM_PTCR) Transmitter Transfer Disable Mask */
#define MEM2MEM_PTCR_TXTDIS                 MEM2MEM_PTCR_TXTDIS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_TXTDIS_Msk instead */
#define MEM2MEM_PTCR_RXCBEN_Pos             16                                             /**< (MEM2MEM_PTCR) Receiver Circular Buffer Enable Position */
#define MEM2MEM_PTCR_RXCBEN_Msk             (_U_(0x1) << MEM2MEM_PTCR_RXCBEN_Pos)          /**< (MEM2MEM_PTCR) Receiver Circular Buffer Enable Mask */
#define MEM2MEM_PTCR_RXCBEN                 MEM2MEM_PTCR_RXCBEN_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_RXCBEN_Msk instead */
#define MEM2MEM_PTCR_RXCBDIS_Pos            17                                             /**< (MEM2MEM_PTCR) Receiver Circular Buffer Disable Position */
#define MEM2MEM_PTCR_RXCBDIS_Msk            (_U_(0x1) << MEM2MEM_PTCR_RXCBDIS_Pos)         /**< (MEM2MEM_PTCR) Receiver Circular Buffer Disable Mask */
#define MEM2MEM_PTCR_RXCBDIS                MEM2MEM_PTCR_RXCBDIS_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_RXCBDIS_Msk instead */
#define MEM2MEM_PTCR_TXCBEN_Pos             18                                             /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Enable Position */
#define MEM2MEM_PTCR_TXCBEN_Msk             (_U_(0x1) << MEM2MEM_PTCR_TXCBEN_Pos)          /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Enable Mask */
#define MEM2MEM_PTCR_TXCBEN                 MEM2MEM_PTCR_TXCBEN_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_TXCBEN_Msk instead */
#define MEM2MEM_PTCR_TXCBDIS_Pos            19                                             /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Disable Position */
#define MEM2MEM_PTCR_TXCBDIS_Msk            (_U_(0x1) << MEM2MEM_PTCR_TXCBDIS_Pos)         /**< (MEM2MEM_PTCR) Transmitter Circular Buffer Disable Mask */
#define MEM2MEM_PTCR_TXCBDIS                MEM2MEM_PTCR_TXCBDIS_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_TXCBDIS_Msk instead */
#define MEM2MEM_PTCR_ERRCLR_Pos             24                                             /**< (MEM2MEM_PTCR) Transfer Bus Error Clear Position */
#define MEM2MEM_PTCR_ERRCLR_Msk             (_U_(0x1) << MEM2MEM_PTCR_ERRCLR_Pos)          /**< (MEM2MEM_PTCR) Transfer Bus Error Clear Mask */
#define MEM2MEM_PTCR_ERRCLR                 MEM2MEM_PTCR_ERRCLR_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTCR_ERRCLR_Msk instead */
#define MEM2MEM_PTCR_MASK                   _U_(0x10F0303)                                 /**< \deprecated (MEM2MEM_PTCR) Register MASK  (Use MEM2MEM_PTCR_Msk instead)  */
#define MEM2MEM_PTCR_Msk                    _U_(0x10F0303)                                 /**< (MEM2MEM_PTCR) Register Mask  */


/* -------- MEM2MEM_PTSR : (MEM2MEM Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MEM2MEM_PTSR_Type;
