ataradov/mcu-starter-projects/samg53/include/component/mem2mem.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MEM2MEM_PTSR_OFFSET                 (0x124)                                       /**<  (MEM2MEM_PTSR) Transfer Status Register  Offset */

#define MEM2MEM_PTSR_RXTEN_Pos              0                                              /**< (MEM2MEM_PTSR) Receiver Transfer Enable Position */
#define MEM2MEM_PTSR_RXTEN_Msk              (_U_(0x1) << MEM2MEM_PTSR_RXTEN_Pos)           /**< (MEM2MEM_PTSR) Receiver Transfer Enable Mask */
#define MEM2MEM_PTSR_RXTEN                  MEM2MEM_PTSR_RXTEN_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTSR_RXTEN_Msk instead */
#define MEM2MEM_PTSR_TXTEN_Pos              8                                              /**< (MEM2MEM_PTSR) Transmitter Transfer Enable Position */
#define MEM2MEM_PTSR_TXTEN_Msk              (_U_(0x1) << MEM2MEM_PTSR_TXTEN_Pos)           /**< (MEM2MEM_PTSR) Transmitter Transfer Enable Mask */
#define MEM2MEM_PTSR_TXTEN                  MEM2MEM_PTSR_TXTEN_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTSR_TXTEN_Msk instead */
#define MEM2MEM_PTSR_RXCBEN_Pos             16                                             /**< (MEM2MEM_PTSR) Receiver Circular Buffer Enable Position */
#define MEM2MEM_PTSR_RXCBEN_Msk             (_U_(0x1) << MEM2MEM_PTSR_RXCBEN_Pos)          /**< (MEM2MEM_PTSR) Receiver Circular Buffer Enable Mask */
#define MEM2MEM_PTSR_RXCBEN                 MEM2MEM_PTSR_RXCBEN_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTSR_RXCBEN_Msk instead */
#define MEM2MEM_PTSR_TXCBEN_Pos             18                                             /**< (MEM2MEM_PTSR) Transmitter Circular Buffer Enable Position */
#define MEM2MEM_PTSR_TXCBEN_Msk             (_U_(0x1) << MEM2MEM_PTSR_TXCBEN_Pos)          /**< (MEM2MEM_PTSR) Transmitter Circular Buffer Enable Mask */
#define MEM2MEM_PTSR_TXCBEN                 MEM2MEM_PTSR_TXCBEN_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTSR_TXCBEN_Msk instead */
#define MEM2MEM_PTSR_ERR_Pos                24                                             /**< (MEM2MEM_PTSR) Transfer Bus Error Position */
#define MEM2MEM_PTSR_ERR_Msk                (_U_(0x1) << MEM2MEM_PTSR_ERR_Pos)             /**< (MEM2MEM_PTSR) Transfer Bus Error Mask */
#define MEM2MEM_PTSR_ERR                    MEM2MEM_PTSR_ERR_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MEM2MEM_PTSR_ERR_Msk instead */
#define MEM2MEM_PTSR_MASK                   _U_(0x1050101)                                 /**< \deprecated (MEM2MEM_PTSR) Register MASK  (Use MEM2MEM_PTSR_Msk instead)  */
#define MEM2MEM_PTSR_Msk                    _U_(0x1050101)                                 /**< (MEM2MEM_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief MEM2MEM hardware registers */
typedef struct {  
  __IO uint32_t MEM2MEM_THR;    /**< (MEM2MEM Offset: 0x00) Memory to Memory Transfer Holding Register */
  __IO uint32_t MEM2MEM_MR;     /**< (MEM2MEM Offset: 0x04) Memory to Memory Mode Register */
  __O  uint32_t MEM2MEM_IER;    /**< (MEM2MEM Offset: 0x08) Memory to Memory Interrupt Enable Register */
  __O  uint32_t MEM2MEM_IDR;    /**< (MEM2MEM Offset: 0x0C) Memory to Memory Interrupt Disable Register */
  __I  uint32_t MEM2MEM_IMR;    /**< (MEM2MEM Offset: 0x10) Memory to Memory Interrupt Mask Register */
  __I  uint32_t MEM2MEM_ISR;    /**< (MEM2MEM Offset: 0x14) Memory to Memory Interrupt Status Register */
  RoReg8  Reserved1[0xE8];
  __IO uint32_t MEM2MEM_RPR;    /**< (MEM2MEM Offset: 0x100) Receive Pointer Register */
  __IO uint32_t MEM2MEM_RCR;    /**< (MEM2MEM Offset: 0x104) Receive Counter Register */
  __IO uint32_t MEM2MEM_TPR;    /**< (MEM2MEM Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t MEM2MEM_TCR;    /**< (MEM2MEM Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t MEM2MEM_RNPR;   /**< (MEM2MEM Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t MEM2MEM_RNCR;   /**< (MEM2MEM Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t MEM2MEM_TNPR;   /**< (MEM2MEM Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t MEM2MEM_TNCR;   /**< (MEM2MEM Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t MEM2MEM_PTCR;   /**< (MEM2MEM Offset: 0x120) Transfer Control Register */
  __I  uint32_t MEM2MEM_PTSR;   /**< (MEM2MEM Offset: 0x124) Transfer Status Register */
} Mem2mem;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief MEM2MEM hardware registers */
typedef struct {  
  __IO MEM2MEM_THR_Type               MEM2MEM_THR;    /**< Offset: 0x00 (R/W  32) Memory to Memory Transfer Holding Register */
  __IO MEM2MEM_MR_Type                MEM2MEM_MR;     /**< Offset: 0x04 (R/W  32) Memory to Memory Mode Register */
  __O  MEM2MEM_IER_Type               MEM2MEM_IER;    /**< Offset: 0x08 ( /W  32) Memory to Memory Interrupt Enable Register */
  __O  MEM2MEM_IDR_Type               MEM2MEM_IDR;    /**< Offset: 0x0C ( /W  32) Memory to Memory Interrupt Disable Register */
  __I  MEM2MEM_IMR_Type               MEM2MEM_IMR;    /**< Offset: 0x10 (R/   32) Memory to Memory Interrupt Mask Register */
  __I  MEM2MEM_ISR_Type               MEM2MEM_ISR;    /**< Offset: 0x14 (R/   32) Memory to Memory Interrupt Status Register */
  __I  uint32_t                       Reserved1[58];
  __IO MEM2MEM_RPR_Type               MEM2MEM_RPR;    /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO MEM2MEM_RCR_Type               MEM2MEM_RCR;    /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO MEM2MEM_TPR_Type               MEM2MEM_TPR;    /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO MEM2MEM_TCR_Type               MEM2MEM_TCR;    /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO MEM2MEM_RNPR_Type              MEM2MEM_RNPR;   /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO MEM2MEM_RNCR_Type              MEM2MEM_RNCR;   /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO MEM2MEM_TNPR_Type              MEM2MEM_TNPR;   /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO MEM2MEM_TNCR_Type              MEM2MEM_TNCR;   /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  MEM2MEM_PTCR_Type              MEM2MEM_PTCR;   /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  MEM2MEM_PTSR_Type              MEM2MEM_PTSR;   /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Mem2mem;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Memory to Memory */

#endif /* _SAMG53_MEM2MEM_COMPONENT_H_ */
